ekkus93/esp32-macro-keyboard/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_HMAC=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# H12 release provenance: status/diagnostics expose a 39-character ELF-SHA
# build ID in a 40-byte buffer. Pin the resident ESP-IDF SHA string to the
# same length rather than inheriting the shorter SDK default.
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=39
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256

# Disable IPv6 project-wide. This device is a single-AP appliance with no
# IPv6 use anywhere in its design. Found on real hardware 2026-08-10: with
# IPv6 enabled (the ESP-IDF default), esp_http_server's httpd_server_init()
# (esp_http_server/src/httpd_main.c) binds a dual-stack AF_INET6 socket, so
# every real client's getpeername() reports ss_family=AF_INET6 (IPv4-mapped),
# not AF_INET. login_source_ipv4() (web_server_login.c) only accepts
# AF_INET, so every single login attempt failed with 500 on physical
# hardware - a bug host tests never exercise, since the host httpd fake
# doesn't model this dual-stack socket behavior. Disabling LWIP_IPV6 makes
# esp_http_server bind a plain AF_INET socket instead, matching what the
# code already expects.
CONFIG_LWIP_IPV6=n

# NOTE: do NOT set CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y here. On the
# ESP32-S3 the USB-Serial-JTAG peripheral and the USB-OTG controller share
# one internal PHY/pin pair, so routing the console there prevents TinyUSB
# from enumerating the device as a USB HID keyboard at all. Verified on
# hardware. The console lives on UART0 instead - see
# firmware/components/serial_console/serial_console.c.

# Keep a conservative main-task stack while the V2 startup graph is being
# rebuilt. Phase 2 removed the v1 repository recovery path that originally
# required this headroom; reducing it is a separate, measured device-profiling
# task and must not be inferred from the source deletion alone.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# This board is an ESP32-S3R8: `esptool chip_id` reports
# "Features: WiFi, BLE, Embedded PSRAM 8MB (AP_3v3)", i.e. 8 MB of embedded
# OCTAL SPI PSRAM. It was present and unused for the whole project - the chip
# survey recorded it in docs while the build left CONFIG_SPIRAM unset (the
# ESP-IDF default), so the device ran on internal SRAM alone with ~208 KB of
# free heap while 8 MB sat idle.
#
# MODE_OCT is not a guess and not interchangeable: setting QUAD on an octal
# part (or the reverse) leaves the device unable to boot. Re-check with
# `esptool.py chip_id` before changing boards.
#
# PSRAM remains enabled for bounded V2 blob/send buffers and general web
# workloads. It raises the heap ceiling but does not help task stacks: FreeRTOS
# stacks must live in internal SRAM, so stack-overflow defects are unaffected.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# SPEC_V2 §5.3: "FreeRTOS task stacks MUST remain in internal SRAM." ESP-IDF
# defaults this to y once SPIRAM is on, which permits an external task stack via
# xTaskCreateStatic. No task does that today (all three use xTaskCreate), so the
# requirement held by construction only -- the V2-156 audit flagged that a single
# future xTaskCreateStatic would violate §5.3 silently. Pinning it to n makes an
# external stack impossible; check-production-config.sh enforces the value.
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=n
# Allocations below this stay in internal SRAM, so small hot allocations keep
# internal-RAM latency and only large buffers go to PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
